# RebarShapeConstraintRadius Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeConstraintRadius Class
Members See Also
---
A radius constraint associated with an arc in a RebarShapeDefinition.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class RebarShapeConstraintRadius : RebarShapeConstraint
```

Visual Basic
---
```text
Public Class RebarShapeConstraintRadius _
	Inherits RebarShapeConstraint
```

Visual C++
---
```text
public ref class RebarShapeConstraintRadius : public RebarShapeConstraint
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..RebarShapeConstraint Autodesk.Revit.DB.Structure..::..RebarShapeConstraintRadius
# See Also
RebarShapeConstraintRadius Members
Autodesk.Revit.DB.Structure Namespace